Repository: JohnBel/EfsTools
Catalog: EfsTools/Resourses/Strings.*.resx
Languages: ru

# BadFormatConversionErrorFormat1
source: A value not bound to option name is defined with a bad format.
ru: Значение не указано или имеет не верный формат.

# BadFormatConversionErrorFormat2
source: Option '{0}' is defined with a bad format.
ru: Значение опция '{0}' указано с не верным форматом.

# BadFormatTokenErrorFormat
source: Token '{0}' is not recognized.
ru: Токен '{0}' не распознан

# BadVerbSelectedErrorFormat
source: Verb '{0}' is not recognized.
ru: Команда '{0}' не распознана

source: Create EFS directory
ru: Создать EFS директорию

# CriticalErrorFormat
source: Critical error. {0}
ru: Критическая ошибка. {0}

source: Directory path
ru: Путь к директории

source: Display more information on a specific command.
ru: Отобразить больше информации о команде.

source: Display this help screen.
ru: Отобразить справку.

source: Display version information.
ru: Отобразить версию программы

source: Don't create all parent directories
ru: Не создавать отсутвующие родительские директории

source: ERROR(S)
ru: ОШИБКА(И)

# HdlcInvalidResponseCrcFormat
source: Invalid Response CRC Expected: {0:X} - Received: {1:X}
ru: Некорретная контрольная сумма CRC Ожидалось: {0:X} - Получено: {1:X}

# MissingRequiredOptionErrorFormat1
source: A required value not bound to option name is missing.
ru: Требуемое значение не связано с опцией

# MissingRequiredOptionErrorFormat2
source: Option '{0}' is defined with a bad format.
ru: Не задано значение опции '{0}'.

# MissingValueOptionErrorFormat
source: Option '{0}' has no value.
ru: Опция '{0}' не имеет значения

# NoVerbSelectedErrorFormat
source: No verb selected.
ru: Не указана команда

source: Press ENTER to exit
ru: Нажмите ENTER для выхода

# QcdmApplyingModemConfig
source: Applying modem config...
ru: Применение конфигурации модема...

# QcdmCantOpenEfsDirectoryFormat
source: Can't open EFS directory '{0}'. {1}
ru: Не возможно открыть EFS каталог '{0}'. {1}

# QcdmCantOpenEfsFileFormat
source: Can't open EFS file '{0}'. {1}
ru: Не возможно открыть EFS файл '{0}'. {1}

# QcdmCommandBadCmd
source: Bad command
ru: Некорректная команда

# QcdmCommandBadLen
source: Bad lengths
ru: Некорректная длина данных

# QcdmCommandBadMode
source: Bad mode
ru: Некорректный режим

# QcdmCommandBadParm
source: Bad params
ru: Некорректные параметры

# QcdmCommandBadSpcMode
source: Bad SPC mode
ru: Некорректный SPC режим

# QcdmDownloadingNvItems
source: Downloading NV items ...
ru: Загрузка значений элементов NV ...

# QcdmEfsErrorsBadFileNumber
source: Bad file number
ru: Некорректный номер файла

# QcdmEfsErrorsDefaultFormat
source: EFS error. Code = {0}
ru: Ошибка EFS. Код = {0}

# QcdmEfsErrorsDirectoryNotEmpty
source: Directory not empty
ru: Директория не пустая

# QcdmEfsErrorsDirEntNotFound
source: Directory entry not found
ru: Элемент директории EFS не найден

# QcdmEfsErrorsDirNotOpen
source: Directory not open
ru: Директория EFS не открыта

# QcdmEfsErrorsFileExist
source: File exists
ru: Файл существует

# QcdmEfsErrorsInconsistentState
source: Inconsistent state
ru: Противоречивое состояние

# QcdmEfsErrorsInvalidDirEntry
source: Invalid directory entry
ru: Некорректный элемент директории EFS

# QcdmEfsErrorsInvalidPath
source: Invalid path
ru: Некорректный путь

# QcdmEfsErrorsInvalidSequence
source: Invalid sequence
ru: Неправильный номер последовательности

# QcdmEfsErrorsIoError
source: I/O error
ru: Ошибка ввода-вывода

# QcdmEfsErrorsNone
source: None
ru: Нет

# QcdmEfsErrorsNotDirectory
source: Not a directory
ru: Директория не существует

# QcdmEfsErrorsNotEntry
source: No such file or directory
ru: Файл или директория не существует

# QcdmEfsErrorsNotNandFlash
source: Not nand flash
ru: Флаш память не типа NAND

# QcdmEfsErrorsNotPermited
source: Operation not permitted
ru: Операция не разрешена

# QcdmEfsErrorsOutOfMemory
source: Out of memory
ru: Недостаточно памяти

# QcdmEfsErrorsPathTooLong
source: Path too long
ru: Путь EFS очень длинный

# QcdmEfsErrorsPermissionDenided
source: Permission denied
ru: Доступ запрещен

# QcdmEfsErrorsTooManyOpenDirs
source: Too many open directories
ru: Очень много открыто EFS директорий

# QcdmEfsErrorsTooManyOpenFiles
source: Too many open files
ru: Очень много открыто EFS файлов

# QcdmEfsErrorsUnavailableInfo
source: Unavailable info
ru: Информация не доступна

# QcdmEfsErrorsUnknownFileType
source: Unknown file type
ru: Неизвестный тип файла

# QcdmErrorOnCreateDirectoryFormat
source: Error on create directory '{0}'. {1}
ru: Ошибка при создании директории '{0}'. {1}

# QcdmErrorOnDeleteDirectoryFormat
source: Error on delete directory '{0}'. {1}
ru: Ошибка при удалении директории '{0}'. {1}

# QcdmErrorOnDeleteFileFormat
source: Error on delete file '{0}'. {1}
ru: Ошибка при удалении файла '{0}'. {1}

# QcdmErrorOnDownloadDirectoryFormat
source: Error on download directory '{0}'. {1}
ru: Ошибка при загрузке директории '{0}'. {1}

# QcdmErrorOnDownloadFormat
source: Error on download file '{0}'. {1}
ru: Ошибка при загрузке файла '{0}'. {1}

# QcdmErrorOnFixFileNamesFormat
source: Error on fix file names in '{0}'. {1}
ru: Ошибка при исправлении имени файла '{0}'. {1}

# QcdmErrorOnOpenDirectoryFormat
source: Error on open directory '{0}'. {1}
ru: Ошибка при открытии EFS директории '{0}'. {1}

# QcdmErrorOnUploadDirectoryFormat
source: Error on upload directory '{0}'. {1}
ru: Ошибка при выгрузке директории '{0}'. {1}

# QcdmErrorOnUploadFormat
source: Error on upload file '{0}'. {1}
ru: Ошибка при выгрузке файла '{0}'. {1}

# QcdmFixFileNameFormat
source: Fixed file name '{0}' to '{1}' in folder '{2}'
ru: Исправлено имя файла '{0}' на '{1}' в директории '{2}'

# QcdmGeneratingModemConfig
source: Getting modem config...
ru: Получение конфигурации модема...

# QcdmInvalidLogMask
source: Invalid log mask
ru: Некорректная маска лога

# QcdmInvalidPassword
source: Invalid password
ru: Некорректный пароль

# QcdmInvalidResponse
source: Invalid response
ru: Некорректный ответ

# QcdmInvalidResponseCommand
source: Invalid response command
ru: Некорректная команда в ответе

# QcdmInvalidResponseLength
source: Invalid response length
ru: Некорректная длина ответа

# QcdmInvalidSpc
source: Invalid SPC
ru: Некорректный SPC

# QcdmListOfDirectoryFormat
source: Listing of directory '{0}':
ru: Директория '{0}':

# QcdmProcessingFormat
source: Processing '{0}' ...
ru: Обработка '{0}' ...

# QcdmSerialPortIsNotOpen
source: Serial port is not open
ru: Последовательный порт не открыт

# QcdmUnsupportedCommandResponseFormat
source: Unsupported command response ({0})
ru: Неподдерживаемая команда ({0})

# QcdmUnsupportedSubsysCommandResponseFormat
source: Unsupported subsystem command response ({0})
ru: Неподдерживаемая команда Subsys ({0})

# QcdmUploadingNvItems
source: Uploading NV items ...
ru: Установка значений элементов NV ...

# RepeatedOptionErrorFormat
source: Option '{0}' is defined multiple times.
ru: Опция '{0}' указана несколько раз.

source: Required
ru: Требуется

# UnknownOptionErrorFormat
source: Option '{0}' is unknown.
ru: Опция '{0}' не известна

source: USAGE
ru: ЗАПУСК

# QcdmManyLogLines
source: Many log lines. Please disable log.
ru: Много строк лога. Пожалуйста отключите логирование.

# MbnExtractorInvalidFormatCantFindMagicString
source: Invalid MBN format. Can't find magic string 'MCFG'
ru: Не корректный формат MBN. Отсутствует магическая строка 'MCFG'

# MbnExtractorInvalidFormatElfDataNotExist
source: Invalid MBN format. ELF segment with data not exist
ru: Не корректный формат MBN. Не найден сегмент ELF с данными

# MbnExtractorInvalidFormatInvalidHeaderVersionId
source: Invalid MBN format. Invalid header version id
ru: Не корректный формат MBN. Заголовок не содержит идентификатора версии

# MbnExtractorInvalidFormatInvalidHeaderVersionValue
source: Invalid MBN format. Invalid header version value
ru: Не корректный формат MBN. Некорректное значение версии в заголовке

# MbnExtractorInvalidFormatInvalidInvalidFileHeaderMagic
source: Invalid MBN format. Invalid file header magic
ru: Не корректный формат MBN. Некорректный размер заголока файла

# MbnExtractorInvalidFormatInvalidInvalidFileItemSize
source: Invalid MBN format. Invalid file item size
ru: Не корректный формат MBN. Некорректный размер данных типа 'файл'

# MbnExtractorInvalidFormatInvalidInvalidFileSizeMagic
source: Invalid MBN format. Invalid file size magic
ru: Не корректный формат MBN. Некорректный размер магической строки заголока файла

# MbnExtractorInvalidFormatInvalidInvalidNvItemSize
source: Invalid MBN format. Invalid NV item size
ru: Не корректный формат MBN. Некорректный размер данных типа 'NV'

# MbnExtractorInvalidFormatInvalidTrailerMagic1
source: Invalid MBN format. Invalid trailer magic '0x0A'
ru: Не корректный формат MBN. Отсутствует магическая строка '0x0A' в трейлере

# MbnExtractorInvalidFormatInvalidTrailerMagic2
source: Invalid MBN format. Invalid trailer magic '0xA1'
ru: Не корректный формат MBN. Отсутствует магическая строка '0xA1' в трейлере

# MbnExtractorInvalidFormatInvalidTrailerMagicValue
source: Invalid MBN format. Invalid trailer magic 'MCFG_TRL'
ru: Не корректный формат MBN. Отсутствует магическая строка 'MCFG_TRL' в трейлере

# MbnExtractorInvalidFormatInvalidTrailerSize
source: Invalid MBN format. Invalid trailer size
ru: Не корректный формат MBN. Некорректный размер трейлера

# MbnExtractorInvalidFormatUnknownItemType
source: Invalid MBN format. Unknown item type
ru: Не корректный формат MBN. Неизвестный тип данных

# QcdmUseComPortFormat
source: Use serial port '{0}'
ru: COM-порт: '{0}'

# QcdmExtractingMbnFileFormat
source: Extracting MBN file '{0}' ...
ru: Распаковка файла MBN '{0}' ...

# QcdmErrorOnSetEventMask
source: Error on set event mask
ru: Ошибка при установке маски событий

# QcdmLogSubcribingLogNotSupportedErrorFormat
source: Log '{0}' not supported
ru: Лог '{0}' не поддерживается

# QcdmLogSubcribingMessageNotSupportedErrorFormat
source: Message '{0}' not supported
ru: Сообщение '{0}' не поддерживается

# QcdmLogSubcribingToLogsFormat
source: Subcribing to logs: {0} ...
ru: Подписка на логи : {0} ...

# QcdmLogSubcribingToLogsResultFormat
source: Successfully subscribed to the logs: {0}
ru: Успешно завершена подписка на логи: {0}

# QcdmLogSubcribingToMessagesFormat
source: Subcribing to messages: {0} ...
ru: Подписка на сообщения: {0} ...

# QcdmLogSubcribingToMessagesResultFormat
source: Successfully subscribed to the messages: {0}
ru: Успешно завершена подписка на сообщения: {0}

source: Invalid Response CRC
ru: Некорретная контрольная сумма CRC

# WebDavCopyFormat
source: Copy data from "{0}" to "{1}" ...
ru: Копирование из "{0}" в "{1}" ...

# WebDavCreateCollectionFormat
source: Creating directory "{0}" ...
ru: Создание директории"{0}" ...

# WebDavCreateItemFormat
source: Creating file "{0}" ...
ru: Создание файла "{0}" ...

# WebDavDeleteItemFormat
source: Deleting "{0}" ...
ru: Удаление "{0}" ...

# WebDavErrorCalculationETagFormat
source: Error on calculation ETag. {0}
ru: Ошибка при расчете ETag. {0}

# WebDavErrorCopyStreamFormat
source: Error on copy file to "{0}". {1}
ru: Ошибка при копировании файла в "{0}". {1}

# WebDavErrorCreateCollectionFormat
source: Error create directory "{0}". {1}
ru: Ошибка при создании директории "{0}". {1}

# WebDavErrorCreateItemFormat
source: Error create file "{0}". {1}
ru: Ошибка при создании файла "{0}". {1}

# WebDavErrorDeleteItemFormat
source: Error on delete file "{0}". {1}
ru: Ошибка при удалении файла "{0}". {1}

# WebDavErrorGetItemFormat
source: Error get file "{0}". {1}
ru: Ошибка при получении файла "{0}". {1}

# WebDavErrorGetItemsFormat
source: Error get files "{0}". {1}
ru: Ошибка при получении файлов "{0}". {1}

# WebDavErrorGetReadableStreamFormat
source: Error on open file "{0}". {1}
ru: Ошибка при открытии файла "{0}". {1}

# WebDavErrorMoveItemFormat
source: Error on move file "{0}". {1}
ru: Ошибка при перемещении файла "{0}". {1}

# WebDavErrorOnProcessCollectionRequestFormat
source: Error on process collection request "{0}". {1}
ru: Ошибка при выполнении запроса в директорию "{0}". {1}

# WebDavErrorOnProcessItemRequestFormat
source: Error on process item request "{0}". {1}
ru: Ошибка при выполнении запроса для файла "{0}". {1}

# WebDavErrorUploadFromStreamFormat
source: Error on write file "{0}". {1}
ru: Ошибка при записи в файл "{0}". {1}

# WebDavGetItemFormat
source: Getting "{0}" ...
ru: Получение "{0}" ...

# WebDavGetItemsFormat
source: Gettings items from "{0}" ...
ru: Получение содержимого "{0}" ...

# WebDavGetReadableStreamFormat
source: Getting "{0}" for read ...
ru: Получение "{0}" для чтения ...

# WebDavMoveItemFormat
source: Moving file "{0}" ...
ru: Перемещение файла "{0}" ...

# WebDavProcessingCollectionRequestFormat
source: Processing collection request {1} "{0}"...
ru: Выполенение запроса {1} "{0}"...

# WebDavProcessingItemRequestFormat
source: Processing item request {1} "{0}"...
ru: Выполнение запроса {1} "{0}"...

# WebDavServerStartedFormat
source: WebDAV server is available at "{0}"
ru: WebDAV сервер доступен по адресу "{0}"

# WebDavUploadFromStreamFormat
source: Writing to "{0}" ...
ru: Запись в "{0}" ...

# WebDavWarningPathNotFoundFormat
source: Path "{0}" not found
ru: Путь "{0}" не найден
